004_karman2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (2.2 0 0)
    (2.2 0.41 0)
    (0 0.41 0)
    (0 0 0.1)
    (2.2 0 0.1)
    (2.2 0.41 0.1)
    (0 0.41 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type symmetry;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)

        );
    }
    front
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
