004_karman2/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom    patch;

sourceCase       ".";   // uses current case; can be a separate case
sourcePatches    (front); // 开始面


exposedPatchName back; // 终止面

flipNormals      false;

extrudeModel     plane;
/*
linearNormal:    linear extrusion in point-normal direction
plane:           single-layer, point-normal extrusion with empty type (2D)
linearDirection: linear extrusion in specified direction
wedge:           single-layer, wedge extrusion with wedge type (axisymmetric)
sector:          sector extrusion about specified axis
linearRadial:    linear extrusion in radial direction
radial:          linear extrusion in radial direction with multiple radii
*/

thickness        0.1; // used by plane extrusion

nLayers          1; // 只有1个面
expansionRatio   1.0;

// Merge front and back patches, typically for 360 deg wedge extrusion
mergeFaces       false;
mergeTol         0;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
