004_karman2/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    cylinder
    {
        type    searchableCylinder;
        point1  (0.2 0.2 0);
        point2  (0.2 0.2 0.1);
        radius  0.05;
    }
    refinementBox
    {
        type    searchableBox;
        min (0.1 0.1 0);
        max (0.4 0.3 0.1);
    }
};

castellatedMeshControls
{
    features
    (
//      { file "CAD.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        cylinder
        {
            level (2 2);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        fefinementBox
        {
            mode    inside;
            levels  ((1e15 1));
        }
    }
    insidePoint (1 0.1 0.01); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    true;
    implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        cylinder
        {
            nSurfaceLayers 5;
        }
    }

    relativeSizes       true; // false, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
//  firstLayerThickness 0.01;

//  maxThicknessToMedialRatio 0.6;
}

meshQualityControls
{}

writeFlags
(
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-5;

// ************************************************************************* //
